# Generated/curated for gilpeled. Update via: brew bundle dump --describe --mas --force

### Taps
tap "anomalyco/tap"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "felixkratz/formulae"

### Formulas
brew "bat"
brew "btop"
brew "dua-cli"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git-delta"
brew "git-lfs"
brew "gitleaks"
brew "glow"
brew "imagemagick"
brew "lazydocker"
brew "mas"
brew "node"
brew "nvm"
brew "podman"
brew "pnpm"
brew "ripgrep"
brew "ruby-install"
brew "stow"
brew "thefuck"
brew "tlrc"
brew "tmux"
brew "uv"
brew "viu"
brew "wget"
brew "xcbeautify"
brew "xcode-build-server"
brew "xcodegen"
brew "xdelta"
brew "yt-dlp"
brew "zoxide"
brew "anomalyco/tap/rtk"
brew "felixkratz/formulae/borders"
brew "oven-sh/bun/bun"

### Casks
cask "1password"
# amphetamine is Mac-App-Store-only. After signing into MAS, install via:
#   mas install 937984704
# (or open Mac App Store, search "Amphetamine", click install)
cask "android-studio"
cask "asana"
cask "audacity"
cask "chatgpt"
cask "claude"
cask "cursor"
cask "font-meslo-lg-nerd-font"
cask "iterm2"
cask "jetbrains-toolbox"
cask "logi-options-plus"
cask "mounty"
cask "nikitabobko/tap/aerospace"
cask "sequel-ace"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "tailscale"
cask "unity-hub"
cask "vlc"
cask "whatsapp"
cask "zoom"
# TODO: codex.app — uncertain whether this is a known cask. Add `cask "codex"` if it exists.

### Mac App Store
mas "Xcode", id: 497799835
# TODO: fill in MAS ids after first install. Run `mas list` and add:
# mas "Copilot for Xcode", id: ?
# mas "SwiftFormat for Xcode", id: ?
